Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mce.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_mce equates.
 */
#pragma once

#include    <stdint.h>

// MCE address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    SR;
    volatile    uint32_t    IASR;
    volatile    uint32_t    IACR;
    volatile    uint32_t    IAIER;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    IADDR;
    volatile    uint32_t    RESERVED1[6];
    volatile    uint32_t    REGCR1;
    volatile    uint32_t    SADDR1;
    volatile    uint32_t    EADDR1;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    REGCR2;
    volatile    uint32_t    SADDR2;
    volatile    uint32_t    EADDR2;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    REGCR3;
    volatile    uint32_t    SADDR3;
    volatile    uint32_t    EADDR3;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    REGCR4;
    volatile    uint32_t    SADDR4;
    volatile    uint32_t    EADDR4;
    volatile    uint32_t    RESERVED5[97];
    volatile    uint32_t    MKEYR0;
    volatile    uint32_t    MKEYR1;
    volatile    uint32_t    MKEYR2;
    volatile    uint32_t    MKEYR3;
    volatile    uint32_t    MKEYR4;
    volatile    uint32_t    MKEYR5;
    volatile    uint32_t    MKEYR6;
    volatile    uint32_t    MKEYR7;
    volatile    uint32_t    FMKEYR0;
    volatile    uint32_t    FMKEYR1;
    volatile    uint32_t    FMKEYR2;
    volatile    uint32_t    FMKEYR3;
    volatile    uint32_t    FMKEYR4;
    volatile    uint32_t    FMKEYR5;
    volatile    uint32_t    FMKEYR6;
    volatile    uint32_t    FMKEYR7;
    volatile    uint32_t    CC1CFGR;
    volatile    uint32_t    CC1NR0;
    volatile    uint32_t    CC1NR1;
    volatile    uint32_t    CC1KEYR0;
    volatile    uint32_t    CC1KEYR1;
    volatile    uint32_t    CC1KEYR2;
    volatile    uint32_t    CC1KEYR3;
    volatile    uint32_t    RESERVED6[5];
    volatile    uint32_t    CC2CFGR;
    volatile    uint32_t    CC2NR0;
    volatile    uint32_t    CC2NR1;
    volatile    uint32_t    CC2KEYR0;
    volatile    uint32_t    CC2KEYR1;
    volatile    uint32_t    CC2KEYR2;
    volatile    uint32_t    CC2KEYR3;
} MCE_TypeDef;

#if (defined(__cplusplus))
#define MCE1_NS     reinterpret_cast<MCE_TypeDef *>(0x4802B800u)
#define MCE1_S      reinterpret_cast<MCE_TypeDef *>(0x5802B800u)
#define MCE2_NS     reinterpret_cast<MCE_TypeDef *>(0x4802BC00u)
#define MCE2_S      reinterpret_cast<MCE_TypeDef *>(0x5802BC00u)
#define MCE3_NS     reinterpret_cast<MCE_TypeDef *>(0x4802C000u)
#define MCE3_S      reinterpret_cast<MCE_TypeDef *>(0x5802C000u)

#else
#define MCE1_NS     ((MCE_TypeDef *)0x4802B800u)
#define MCE1_S      ((MCE_TypeDef *)0x5802B800u)
#define MCE2_NS     ((MCE_TypeDef *)0x4802BC00u)
#define MCE2_S      ((MCE_TypeDef *)0x5802BC00u)
#define MCE3_NS     ((MCE_TypeDef *)0x4802C000u)
#define MCE3_S      ((MCE_TypeDef *)0x5802C000u)
#endif

// CR Configuration

#define MCE_CR_CIPHERSEL            (0x3u<<4)
#define MCE_CR_CIPHERSEL_0          (0x1u<<4)
#define MCE_CR_MKLOCK               (0x1u<<1)
#define MCE_CR_GLOCK                (0x1u<<0)

#define MCE_CR_CIPHERSEL_B_0X1      (0x1u<<4)
#define MCE_CR_CIPHERSEL_B_0X2      (0x2u<<4)
#define MCE_CR_CIPHERSEL_B_0X3      (0x3u<<4)
#define MCE_CR_CIPHERSEL_B_0X0      (0x0u<<4)
#define MCE_CR_MKLOCK_B_0X0         (0x0u<<1)
#define MCE_CR_MKLOCK_B_0X1         (0x1u<<1)
#define MCE_CR_GLOCK_B_0X0          (0x0u<<0)
#define MCE_CR_GLOCK_B_0X1          (0x1u<<0)

// SR Configuration

#define MCE_SR_ENCDIS               (0x1u<<4)
#define MCE_SR_FMKVALID             (0x1u<<2)
#define MCE_SR_MKVALID              (0x1u<<0)

#define MCE_SR_ENCDIS_B_0X0         (0x0u<<4)
#define MCE_SR_ENCDIS_B_0X1         (0x1u<<4)
#define MCE_SR_FMKVALID_B_0X0       (0x0u<<2)
#define MCE_SR_FMKVALID_B_0X1       (0x1u<<2)
#define MCE_SR_MKVALID_B_0X0        (0x0u<<0)
#define MCE_SR_MKVALID_B_0X1        (0x1u<<0)

// IASR Configuration

#define MCE_IASR_IAEF               (0x1u<<1)

// IACR Configuration

#define MCE_IACR_IAEF               (0x1u<<1)

// IAIER Configuration

#define MCE_IAIER_IAEIE             (0x1u<<1)

#define MCE_IAIER_IAEIE_B_0X0       (0x0u<<1)
#define MCE_IAIER_IAEIE_B_0X1       (0x1u<<1)

// IADDR Configuration

#define MCE_IADDR_IADD              (0xFFFFFFFFu<<0)
#define MCE_IADDR_IADD_0            (0x1u<<0)

// REGCR1 Configuration

#define MCE_REGCR1_ENC              (0x3u<<14)
#define MCE_REGCR1_ENC_0            (0x1u<<14)
#define MCE_REGCR1_CTXID            (0x3u<<9)
#define MCE_REGCR1_CTXID_0          (0x1u<<9)
#define MCE_REGCR1_BREN             (0x1u<<0)

#define MCE_REGCR1_ENC_B_0X0        (0x0u<<14)
#define MCE_REGCR1_ENC_B_0X1        (0x1u<<14)
#define MCE_REGCR1_ENC_B_0X2        (0x2u<<14)
#define MCE_REGCR1_ENC_B_0X3        (0x3u<<14)
#define MCE_REGCR1_CTXID_B_0X0      (0x0u<<9)
#define MCE_REGCR1_CTXID_B_0X1      (0x1u<<9)
#define MCE_REGCR1_CTXID_B_0X2      (0x2u<<9)
#define MCE_REGCR1_BREN_B_0X0       (0x0u<<0)
#define MCE_REGCR1_BREN_B_0X1       (0x1u<<0)

// SADDR1 Configuration

#define MCE_SADDR1_BADDSTART        (0xFFFFFu<<12)
#define MCE_SADDR1_BADDSTART_0      (0x1u<<12)

// EADDR1 Configuration

#define MCE_EADDR1_BADDEND          (0xFFFFFu<<12)
#define MCE_EADDR1_BADDEND_0        (0x1u<<12)

// REGCR2 Configuration

#define MCE_REGCR2_ENC              (0x3u<<14)
#define MCE_REGCR2_ENC_0            (0x1u<<14)
#define MCE_REGCR2_CTXID            (0x3u<<9)
#define MCE_REGCR2_CTXID_0          (0x1u<<9)
#define MCE_REGCR2_BREN             (0x1u<<0)

#define MCE_REGCR2_ENC_B_0X0        (0x0u<<14)
#define MCE_REGCR2_ENC_B_0X1        (0x1u<<14)
#define MCE_REGCR2_ENC_B_0X2        (0x2u<<14)
#define MCE_REGCR2_ENC_B_0X3        (0x3u<<14)
#define MCE_REGCR2_CTXID_B_0X0      (0x0u<<9)
#define MCE_REGCR2_CTXID_B_0X1      (0x1u<<9)
#define MCE_REGCR2_CTXID_B_0X2      (0x2u<<9)
#define MCE_REGCR2_BREN_B_0X0       (0x0u<<0)
#define MCE_REGCR2_BREN_B_0X1       (0x1u<<0)

// SADDR2 Configuration

#define MCE_SADDR2_BADDSTART        (0xFFFFFu<<12)
#define MCE_SADDR2_BADDSTART_0      (0x1u<<12)

